Repository: phl0/wavelog
Catalog: install/includes/gettext/locale/*/LC_MESSAGES/installer.po
Languages: es_es

source: not detected
es_es: no detectado

source: Albanian
es_es: Albanés

source: Armenian
es_es: Armenio

source: Bosnian
es_es: Bosnio

source: Bulgarian
es_es: Búlgaro

source: Chinese (Simplified)
es_es: Chino (Simplificado)

source: Croatian
es_es: Croata

source: Czech
es_es: Checo

source: Dutch
es_es: Holandés

source: English
es_es: Inglés

source: Estonian
es_es: Estonio

source: Finnish
es_es: Finlandés

source: French
es_es: Francés

source: German
es_es: Alemán

source: Greek
es_es: Griego

source: Hungarian
es_es: Húngaro

source: Italian
es_es: Italiano

source: Latvian
es_es: Letón

source: Lithuanian
es_es: Lituano

source: Montenegrin
es_es: Montenegrino

source: Polish
es_es: Polaco

source: Portuguese
es_es: Portugués

source: Russian
es_es: Ruso

source: Serbian
es_es: Serbio

source: Slovenian
es_es: Esloveno

source: Spanish
es_es: Español

source: Swedish
es_es: Sueco

source: Turkish
es_es: Turco

source: Install | Wavelog
es_es: Instalar | Wavelog

source: 1. Welcome
es_es: 1. Bienvenido

source: 2. Pre Checks
es_es: 2. Comprobaciones previas

source: 3. Configuration
es_es: 3. Configuración

source: 4. Database
es_es: 4. Base de datos

source: 5. First User
es_es: 5. Primer Usuario

source: 6. Finish
es_es: 6. Terminar

source: Welcome to the Wavelog Installer
es_es: Bienvenido al Instalador de Wavelog

source: This installer will guide you through the necessary steps for the installation of Wavelog. <br>Wavelog is a powerful web-based amateur radio logging software. Follow the steps in each tab to configure and install Wavelog on your server.
es_es: Este instalador te guiará a través de los pasos necesarios para la instalación de Wavelog. <br>Wavelog es un potente software de registro de radioaficionados basado en la web. Sigue los pasos en cada pestaña para configurar e instalar Wavelog en tu servidor.

source: Discussions
es_es: Discusiones

source: If you encounter any issues or have questions, refer to the documentation (%s) or community forum (%s) on Github for assistance.
es_es: Si encuentras algún problema o tienes preguntas, consulta la documentación (%s) o el foro de la comunidad (%s) en Github para obtener ayuda.

source: Thank you for installing Wavelog!
es_es: ¡Gracias por instalar Wavelog!

source: Language
es_es: Idioma

source: Select a language
es_es: Selecciona un idioma

source: Close
es_es: Cerrar

source: PHP Modules
es_es: Módulos PHP

source: Version
es_es: Versión

# PHP Version
source: min. %s (recommended %s+)
es_es: min. %s (recomendado %s+)

source: Installed
es_es: Instalado

source: Not Installed
es_es: No instalado

source: PHP Settings
es_es: Configuraciones de PHP

source: Folder Write Permissions
es_es: Permisos de escritura en la carpeta

source: Success
es_es: Éxito

source: Failed
es_es: Fallido

source: Web Server
es_es: Servidor web

source: Version:
es_es: Versión:

source: Important note for nginx users!
es_es: ¡Nota importante para los usuarios de nginx!

source: Since you are using nginx as web server please make sure that you have made the changes described in the Wiki before continuing.
es_es: Dado que estás usando nginx como servidor web, asegúrate de haber realizado los cambios descritos en la Wiki antes de continuar.

source: Some Checks have failed!
es_es: ¡Algunas verificaciones han fallado!

source: Check your PHP settings and install missing modules if necessary.
es_es: Revisa tu configuración de PHP e instala los módulos que falten si es necesario.

source: After that, you have to restart your webserver and start the installer again.
es_es: Después de eso, tienes que reiniciar tu servidor web y comenzar el instalador de nuevo.

source: In case of failed 'Folder Write Permissions' check out our Wiki <a href='%s' target='_blank'>here</a>.
es_es: En caso de fallo en 'Permisos de Escritura de Carpeta', consulta nuestra Wiki <a href='%s' target='_blank'>aquí</a>.

source: You have some warnings!
es_es: ¡Tienes algunas advertencias!

source: Some of the settings are not optimal. You can proceed with the installer but be aware that you could run into problems while using Wavelog.
es_es: Algunas de las configuraciones no son óptimas. Puedes continuar con el instalador, pero ten en cuenta que podrías tener problemas al usar Wavelog.

source: All Checks are OK. You can continue.
es_es: Todas las comprobaciones están bien. Puedes continuar.

source: Configure some basic parameters for your wavelog instance. You can change them later in 'application/config/config.php'
es_es: Configura algunos parámetros básicos para tu instancia de wavelog. Puedes cambiarlos más tarde en 'application/config/config.php'

source: This is the URL where you can access this Wavelog instance after the installer has run. If this does not display what you expect, you may need to check your web server configuration. This is the base_url in your config.php, which can be edited after the installation.
es_es: Esta es la URL donde puedes acceder a esta instancia de Wavelog después de que se haya ejecutado el instalador. Si esto no muestra lo que esperas, es posible que necesites revisar la configuración de tu servidor web. Esta es la base_url en tu config.php, que se puede editar después de la instalación.

source: Your final Wavelog URL
es_es: Tu URL final de Wavelog

source: Optional: Global Callbook Lookup
es_es: Opcional: Búsqueda en el Callbook Global

source: This configuration is optional. The callsign lookup will be available for all users of this installation. You can choose between QRZ.com and HamQTH. While HamQTH also works without username and password, you will need credentials for QRZ.com. To also get the Call Locator in QRZ.com you'll need an XML subscription. HamQTH does not always provide the locator information.
es_es: Esta configuración es opcional. La búsqueda de indicativos estará disponible para todos los usuarios de esta instalación. Puedes elegir entre QRZ.com y HamQTH. Mientras que HamQTH también funciona sin nombre de usuario y contraseña, necesitarás credenciales para QRZ.com. Para obtener también el Localizador de Indicativos en QRZ.com necesitarás una suscripción XML. HamQTH no siempre proporciona la información del localizador.

source: Username
es_es: Nombre de usuario

source: Password
es_es: Contraseña

source: Callbook Username
es_es: Nombre de usuario del Callbook

source: Callbook Password
es_es: Contraseña del Callbook

source: Password can't contain %s or be empty
es_es: La contraseña no puede contener %s ni estar vacía

source: Good to know:
es_es: Bueno saber:

source: Use your callsign as your username for QRZ.com. The XML API does not support email addresses.
es_es: Utiliza tu indicativo como tu nombre de usuario para QRZ.com. La API XML no admite direcciones de correo electrónico.

source: Advanced Settings
es_es: Configuraciones avanzadas

source: These settings should only be set if you know what you're doing.
es_es: Estas configuraciones solo deben establecerse si sabes lo que estás haciendo.

source: Error Logs
es_es: Registros de errores

source: Optional: Enable Error Logging by setting the log threshold bigger then 0. Only enable this if you really need it.
es_es: Opcional: Habilita el registro de errores configurando el umbral de registro mayor que 0. Solo habilítalo si realmente lo necesitas.

source: 0 - No logs
es_es: 0 - Sin registros

source: 1 - Error messages
es_es: 1 - Mensajes de error

source: 2 - Debug messages
es_es: 2 - Mensajes de depuración

source: 3 - Info messages
es_es: 3 - Mensajes informativos

source: 4 - All messages
es_es: 4 - Todos los mensajes

source: To properly install Wavelog you already should have setup a mariadb/mysql database. Provide the parameters here.
es_es: Para instalar correctamente Wavelog, ya deberías haber configurado una base de datos mariadb/mysql. Proporciona los parámetros aquí.

source: Hostname or IP
es_es: Nombre de host o IP

source: Usually 'localhost'.<br>Optional with '[host]:[port]'. Default port: 3306.<br>In a docker compose install type 'wavelog-db'.
es_es: Normalmente 'localhost'.<br>Opcional con '[host]:[port]'. Puerto predeterminado: 3306.<br>En una instalación de docker compose, escribe 'wavelog-db'.

source: Database Name
es_es: Nombre de la base de datos

source: Name of the Database
es_es: Nombre de la base de datos

source: Username of the Database User which has full access to the database.
es_es: Nombre de usuario de la base de datos que tiene acceso completo a la base de datos.

source: Password of the Database User
es_es: Contraseña del Usuario de la Base de Datos

source: Connection Test
es_es: Prueba de conexión

source: Now you can create your first user in Wavelog. Fill out all fields and click continue. Make sure you use a safe password.
es_es: Ahora puedes crear tu primer usuario en Wavelog. Rellena todos los campos y haz clic en continuar. Asegúrate de usar una contraseña segura.

source: All fields are required!
es_es: ¡Todos los campos son obligatorios!

source: First Name
es_es: Nombre

source: Please select one
es_es: Por favor selecciona uno

source: Deleted DXCC
es_es: DXCC Eliminado

source: Last Name
es_es: Apellidos

source: Callsign
es_es: Indicativo

source: Gridsquare/Locator
es_es: Cuadrícula/Localizador

source: City
es_es: Ciudad

source: Confirm Password
es_es: Confirmar Contraseña

source: Timezone
es_es: Zona horaria

source: E-Mail Address
es_es: Dirección de correo electrónico

source: Checklist
es_es: Lista de verificación

source: Pre-Checks
es_es: Comprobaciones previas

source: Configuration
es_es: Configuración

source: Database
es_es: Base de datos

source: First User
es_es: Primer Usuario

source: Nearly done!
es_es: ¡Ya casi está!

source: You prepared all neccessary steps.
es_es: Has preparado todos los pasos necesarios.

source: We now can install Wavelog. This process can take a few minutes.
es_es: Ahora podemos instalar Wavelog. Este proceso puede tardar unos minutos.

source: Reset
es_es: Restablecer

source: Installer Reset
es_es: Reinicio del instalador

source: Do you really want to reset all data and start from scratch?
es_es: ¿Realmente quieres restablecer todos los datos y empezar desde cero?

source: Yes
es_es: Sí

source: Back
es_es: Atrás

source: Continue
es_es: Continuar

source: You can't continue. Solve the red marked issues, restart the webserver and reload this page.
es_es: No puedes continuar. Resuelve los problemas marcados en rojo, reinicia el servidor web y recarga esta página.

source: Password can't contain ' / \ < >
es_es: La contraseña no puede contener ' / \ < >

source: The callsign should not contain any pre- or suffixes as it is used as personal operator callsign.
es_es: El indicativo no debe contener prefijos ni sufijos, ya que se utiliza como indicativo personal del operador.

source: The callsign can not contain any special characters. It's your personal callsign without any pre- or suffixes.
es_es: El indicativo no puede contener caracteres especiales. Es tu indicativo personal sin prefijos ni sufijos.

source: Error: At least Hostname/IP, Database Name and Username are required.
es_es: Error: Se requieren al menos el nombre de host/IP, el nombre de la base de datos y el nombre de usuario.

source: Connecting...
es_es: Conectando...

source: Connection was successful and your database should be compatible.
es_es: La conexión fue exitosa y tu base de datos debería ser compatible.

source: Connection was successful but your database seems too old for Wavelog. You can try to continue but you could run into issues.
es_es: La conexión fue exitosa, pero tu base de datos parece demasiado antigua para Wavelog. Puedes intentar continuar, pero podrías encontrarte con problemas.

source: The min. version for MySQL is %s, for MariaDB it's %s.
es_es: La versión mínima para MySQL es %s, para MariaDB es %s.

source: Search
es_es: Buscar

source: At least one field is empty.
es_es: Al menos un campo está vacío.

source: Stop here for a Moment. Your chosen DXCC is outdated and not valid anymore. Check which DXCC for this particular location is the correct one. If you are sure, ignore this warning.
es_es: Deténgase aquí un momento. Su DXCC elegido está obsoleto y ya no es válido. Comprueba cuál es el DXCC correcto para esta localización en particular. Si está seguro, ignore esta advertencia.

source: The locator seems to be not in the correct format. Should look like AA11AA (6-char grid locator).
es_es: El localizador parece no estar en el formato correcto. Debería verse como AA11AA (localizador de cuadrícula de 6 caracteres).

source: The e-mail adress does not look correct. Make sure it's a valid e-mail address
es_es: La dirección de correo electrónico no parece correcta. Asegúrate de que sea una dirección de correo electrónico válida

source: Password should be at least 8 characters long
es_es: La contraseña debe tener al menos 8 caracteres de longitud

source: Passwords do not match
es_es: Las contraseñas no coinciden

source: Install Now
es_es: Instalar ahora

source: Install not possible. Checklist incomplete.
es_es: Instalación no posible. Lista de verificación incompleta.

source: PHP Module missing
es_es: Módulo PHP faltante

source: The following PHP modules are missing:
es_es: Faltan los siguientes módulos de PHP:

source: Without this module the Wavelog Installer does not work!
es_es: ¡Sin este módulo, el instalador de Wavelog no funciona!

source: Please install the required modules and restart the webserver.
es_es: Por favor, instala los módulos necesarios y reinicia el servidor web.

source: Installation
es_es: Instalación

source: Please wait...
es_es: Por favor espera...

source: Copy config.php to application/config/
es_es: Copia config.php a application/config/

source: Copy database.php to application/config/
es_es: Copia database.php a application/config/

source: Creating database tables
es_es: Creando tablas de base de datos

source: Running database migrations
es_es: Ejecutando migraciones de base de datos

source: Updating DXCC data
es_es: Actualizando datos de DXCC

source: Lock the installer
es_es: Bloquea el instalador

source: All install steps went through. Redirect to user login in %s seconds...
es_es: Todos los pasos de instalación se completaron. Redirigiendo al inicio de sesión del usuario en %s segundos...

source: Done. Go to the user login ->
es_es: Hecho. Ir al inicio de sesión de usuario ->

source: Show detailled debug log
es_es: Mostrar registro detallado de depuración

source: Hide detailled debug log
es_es: Ocultar registro de depuración detallado

source: Could not create application/config/config.php
es_es: No se pudo crear application/config/config.php

source: Could not create application/config/database.php
es_es: No se pudo crear application/config/database.php

source: Could not create database tables
es_es: No se pudieron crear las tablas de la base de datos

source: Could not run database migrations
es_es: No se pudieron ejecutar las migraciones de la base de datos

source: Could not update DXCC data
es_es: No se pudo actualizar los datos de DXCC

source: Could not create install/.lock file
es_es: No se pudo crear el archivo install/.lock
